Tekla Open API Reference for Tekla Structures 2025
BinaryFilterExpressionItem Constructor (FilterExpression, BinaryFilterOperatorType)
 Initializes a new instance of the BinaryFilterExpressionItem class.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BinaryFilterExpressionItem(
	FilterExpression FilterExpression,
	BinaryFilterOperatorType BinaryFilterItemOperatorType
)
Public Sub New (
	FilterExpression As FilterExpression,
	BinaryFilterItemOperatorType As BinaryFilterOperatorType
)
Parameters
FilterExpression
Type: Tekla.Structures.Filtering.FilterExpression
The FilterExpression object to collect.
BinaryFilterItemOperatorType
Type: Tekla.Structures.Filtering.BinaryFilterOperatorType
The operator type to be used against the next item.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when a null filter expression is specified.
See Also
Reference
BinaryFilterExpressionItem Class
BinaryFilterExpressionItem Overload
Tekla.Structures.Filtering Namespace